<!-- 

Задание 1

Дан ассоциативный многомерный массив с данными:

$data = [
    'question' => ['почему', 'как', 'зачем', 'столько'],
    'animals' => [
        'birds' => [
            [
                'name' => 'грачи',
            ],
            [
                'name' => 'воробьи',
            ],
        ],
        'others' => [
            [
                ['name' => 'кошки'],
                ['name' => 'рыбы'],
                ['name' => 'собаки'],
            ],
        ],
    ],
    'parts' => [
        'hands' => 'рук',
        'feathers' => 'перьев',
        'eyes' => 'глаз',
    ],
];
Просто выведите строку: "почему грачи не кошки и зачем им столько перьев", используя данные из этого массива $data 

-->

<?php 

$data = [
    'question' => ['почему', 'как', 'зачем', 'столько'],
    'animals' => [
        'birds' => [
            [
                'name' => 'грачи',
            ],
            [
                'name' => 'воробьи',
            ],
        ],
        'others' => [
            [
                ['name' => 'кошки'],
                ['name' => 'рыбы'],
                ['name' => 'собаки'],
            ],
        ],
    ],
    'parts' => [
        'hands' => 'рук',
        'feathers' => 'перьев',
        'eyes' => 'глаз',
    ],
];


/* ===== Ваш код ниже ===== */

$res = $data['animals']['others'][0][1]['name'];

echo $res;
echo "<br>";

$arr1 = $data['question'];
$arr2 = $data['animals']['birds'];
$arr3 = $data['animals']['others'][0];
$arr4 = $data['parts'];

// print_r ($arr3);

$result = $arr1[0] . " " . $arr2[0]['name'] . " не " . $arr3[0]['name'] . " и " . $arr1[2] . " им " . $arr1[3] . " " . $arr4['feathers']  ;
echo $result;


// почему грачи не кошки и зачем им столько перьев", используя данные из этого массива $data